
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>java同步系列之JMM · 蠢萌小呆瓜的工作日志</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-cuav-chapters/cuav-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-theme-fexa/fexa.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../../styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../codePart/part1.html" />
    
    
    <link rel="prev" href="java1.html" />
    

    </head>
    <body>
        
<div class="book">
	<div class="header-inner">
		<!-- LOGO -->
		<div class="logo"></div>
		<span class="title"></span>

		<!-- Search -->
		
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>


		<!-- Nav -->
		<ul class="header-nav">
			<li>
				<a href="http://books.sangkf.cn" target="_blank">作者博客</a>
			</li><li>
				<a href="https://github.com/sangskf/it-s-stupid" target="_blank">GitHub</a>
			</li>
		</ul>
	</div>

	<div class="book-summary">
		<div class="book-summary-title">文档目录</div>
		
		
		<nav role="navigation">
			


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Java相关</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="java1.html">
            
                <a href="java1.html">
            
                    
                    JVM原理讲解
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.2" data-path="java2.html">
            
                <a href="java2.html">
            
                    
                    java同步系列之JMM
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">代码片段</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../codePart/part1.html">
            
                <a href="../codePart/part1.html">
            
                    
                    反射工具类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../codePart/part2.html">
            
                <a href="../codePart/part2.html">
            
                    
                    Cookie工具类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../codePart/part3.html">
            
                <a href="../codePart/part3.html">
            
                    
                    Java图片高保真缩放
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


		</nav>
		
		
	</div>

	<!-- Content nav -->
	<div class="book-anchor">
		<div class="book-anchor-title">在这篇文章中:</div>
		<div class="book-anchor-body">

		</div>
	</div>

	<div class="book-body">
		
		<div class="body-inner">
			
			

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >java同步系列之JMM</a>
    </h1>
</div>




			<div class="page-wrapper" tabindex="-1" role="main">
				<div class="page-inner">
					
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
					<section class="normal markdown-section">
						
						<h1 id="java&#x540C;&#x6B65;&#x7CFB;&#x5217;&#x4E4B;jmm&#xFF08;java-memory-model&#xFF09;">java&#x540C;&#x6B65;&#x7CFB;&#x5217;&#x4E4B;JMM&#xFF08;Java Memory Model&#xFF09;</h1>
<blockquote>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x662F;&#x5728;&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E0A;&#x7684;&#x66F4;&#x9AD8;&#x5C42;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5B83;&#x5C4F;&#x853D;&#x4E86;&#x5404;&#x79CD;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BBF;&#x95EE;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;Java&#x7A0B;&#x5E8F;&#x5728;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x4E0B;&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x8BBF;&#x95EE;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x6548;&#x679C;&#x3002;</p>
</blockquote>
<!-- more -->
<h2 id="&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</h2>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x662F;&#x5728;&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E0A;&#x7684;&#x66F4;&#x9AD8;&#x5C42;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5B83;&#x5C4F;&#x853D;&#x4E86;&#x5404;&#x79CD;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BBF;&#x95EE;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;Java&#x7A0B;&#x5E8F;&#x5728;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x4E0B;&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x8BBF;&#x95EE;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<h2 id="&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x6A21;&#x578B;">&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x6A21;&#x578B;</h2>
<p>&#x5728;&#x6B63;&#x5F0F;&#x8BB2;&#x89E3;Java&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x5FC5;&#x8981;&#x5148;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x786C;&#x4EF6;&#x5C42;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x5728;&#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x786C;&#x4EF6;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;CPU&#x7684;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x662F;&#x975E;&#x5E38;&#x5FEB;&#x7684;&#xFF0C;&#x8FDC;&#x8FDC;&#x9AD8;&#x4E8E;&#x5B83;&#x4ECE;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x78C1;&#x76D8;&#x3001;&#x5149;&#x76D8;&#x3001;&#x7F51;&#x5361;&#x3001;&#x5185;&#x5B58;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x660E;&#x663E;&#x7684;&#x7279;&#x70B9;&#x2014;&#x2014;&#x8DDD;&#x79BB;CPU&#x8D8A;&#x8FD1;&#x7684;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x5F80;&#x5F80;&#x8D8A;&#x5C0F;&#x8D8A;&#x8D35;&#x8D8A;&#x5FEB;&#xFF0C;&#x8DDD;&#x79BB;CPU&#x8D8A;&#x8FDC;&#x7684;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x5F80;&#x5F80;&#x8D8A;&#x5927;&#x8D8A;&#x4FBF;&#x5B9C;&#x8D8A;&#x6162;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;CPU&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x6D6A;&#x8D39;&#x5728;&#x4E86;&#x78C1;&#x76D8;IO&#x3001;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x3001;&#x6570;&#x636E;&#x5E93;&#x8BBF;&#x95EE;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x8BA9;CPU&#x5728;&#x90A3;&#x91CC;&#x767D;&#x767D;&#x7B49;&#x5F85;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5FC5;&#x987B;&#x60F3;&#x529E;&#x6CD5;&#x53BB;&#x628A;CPU&#x7684;&#x8FD0;&#x7B97;&#x80FD;&#x529B;&#x538B;&#x69A8;&#x51FA;&#x6765;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x5F88;&#x5927;&#x7684;&#x6D6A;&#x8D39;&#xFF0C;&#x800C;&#x8BA9;CPU&#x540C;&#x65F6;&#x53BB;&#x5904;&#x7406;&#x591A;&#x9879;&#x4EFB;&#x52A1;&#x5219;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x88AB;&#x8BC1;&#x660E;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x538B;&#x69A8;&#x624B;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;&#x201C;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x201D;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8BA9;CPU&#x5E76;&#x53D1;&#x5730;&#x6267;&#x884C;&#x591A;&#x9879;&#x4EFB;&#x52A1;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x7684;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x8FD0;&#x7B97;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x53EA;&#x4F9D;&#x9760;CPU&#x7684;&#x8BA1;&#x7B97;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#xFF0C;&#x5F80;&#x5F80;&#x8FD8;&#x9700;&#x8981;&#x8DDF;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x5982;&#x8BFB;&#x53D6;&#x8FD0;&#x7B97;&#x6570;&#x636E;&#x3001;&#x5B58;&#x50A8;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x7B49;&#x3002;</p>
<p>&#x524D;&#x9762;&#x6211;&#x4EEC;&#x4E5F;&#x8BF4;&#x8FC7;&#x4E86;&#xFF0C;CPU&#x4E0E;&#x5185;&#x5B58;&#x7684;&#x4EA4;&#x4E92;&#x5F80;&#x5F80;&#x662F;&#x5F88;&#x6162;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x8981;&#x60F3;&#x529E;&#x6CD5;&#x5728;CPU&#x548C;&#x5185;&#x5B58;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E00;&#x79CD;&#x8FDE;&#x63A5;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x8FBE;&#x5230;&#x4E00;&#x79CD;&#x5E73;&#x8861;&#xFF0C;&#x8BA9;&#x8FD0;&#x7B97;&#x80FD;&#x5FEB;&#x901F;&#x5730;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x8FDE;&#x63A5;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;&#x201C;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x201D;&#x3002;</p>
<p>&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x901F;&#x5EA6;&#x662F;&#x975E;&#x5E38;&#x63A5;&#x8FD1;CPU&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x5F15;&#x5165;&#x53C8;&#x5E26;&#x6765;&#x4E86;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x73B0;&#x4EE3;&#x7684;CPU&#x5F80;&#x5F80;&#x662F;&#x6709;&#x591A;&#x4E2A;&#x6838;&#x5FC3;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x6838;&#x5FC3;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x800C;&#x591A;&#x4E2A;&#x6838;&#x5FC3;&#x4E4B;&#x95F4;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x65F6;&#x95F4;&#x7247;&#x7684;&#x7ADE;&#x4E89;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x5730;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x600E;&#x4E48;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E9B;&#x7F13;&#x5B58;&#x4E0E;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x591A;&#x4E2A;&#x6838;&#x5FC3;&#x5728;&#x8BBF;&#x95EE;&#x7F13;&#x5B58;&#x65F6;&#x8981;&#x9075;&#x5FAA;&#x4E00;&#x4E9B;&#x534F;&#x8BAE;&#xFF0C;&#x5728;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#x6839;&#x636E;&#x534F;&#x8BAE;&#x6765;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x6709;MSI&#x3001;MESI&#x3001;MOSI&#x7B49;&#xFF0C;&#x5B83;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x4F55;&#x65F6;&#x5E94;&#x8BE5;&#x8BBF;&#x95EE;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3001;&#x4F55;&#x65F6;&#x5E94;&#x8BE5;&#x8BA9;&#x7F13;&#x5B58;&#x5931;&#x6548;&#x3001;&#x4F55;&#x65F6;&#x5E94;&#x8BE5;&#x8BBF;&#x95EE;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7B49;&#x57FA;&#x672C;&#x539F;&#x5219;&#x3002;</p>
<p><img src="media/15582712510625/JMM1.png" alt="JMM"></p>
<p>&#x800C;&#x968F;&#x7740;CPU&#x80FD;&#x529B;&#x7684;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#xFF0C;&#x4E00;&#x5C42;&#x7F13;&#x5B58;&#x5C31;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x4E86;&#xFF0C;&#x5C31;&#x9010;&#x6E10;&#x884D;&#x751F;&#x51FA;&#x4E86;&#x591A;&#x7EA7;&#x7F13;&#x5B58;&#x3002;</p>
<p>&#x6309;&#x7167;&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x987A;&#x5E8F;&#x548C;CPU&#x7684;&#x7D27;&#x5BC6;&#x7A0B;&#x5EA6;&#xFF0C;CPU&#x7684;&#x7F13;&#x5B58;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E00;&#x7EA7;&#x7F13;&#x5B58;&#xFF08;L1&#xFF09;&#x3001;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#xFF08;L2&#xFF09;&#x3001;&#x4E09;&#x7EA7;&#x7F13;&#x5B58;&#xFF08;L3&#xFF09;&#xFF0C;&#x6BCF;&#x4E00;&#x7EA7;&#x7F13;&#x5B58;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4E0B;&#x4E00;&#x7EA7;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x8FD9;&#x4E09;&#x79CD;&#x7F13;&#x5B58;&#x7684;&#x6280;&#x672F;&#x96BE;&#x5EA6;&#x548C;&#x5236;&#x4F5C;&#x6210;&#x672C;&#x662F;&#x76F8;&#x5BF9;&#x9012;&#x51CF;&#x7684;&#xFF0C;&#x5BB9;&#x91CF;&#x4E5F;&#x662F;&#x76F8;&#x5BF9;&#x9012;&#x589E;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x6709;&#x4E86;&#x591A;&#x7EA7;&#x7F13;&#x5B58;&#x540E;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#xFF1A;</p>
<p>&#x5F53;CPU&#x8981;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x4ECE;&#x4E00;&#x7EA7;&#x7F13;&#x5B58;&#x4E2D;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x627E;&#x5230;&#x518D;&#x4ECE;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#x4E2D;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x627E;&#x5230;&#x518D;&#x4ECE;&#x4E09;&#x7EA7;&#x7F13;&#x5B58;&#x4E2D;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x627E;&#x5230;&#x518D;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x67E5;&#x627E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x628A;&#x627E;&#x5230;&#x7684;&#x6570;&#x636E;&#x4F9D;&#x6B21;&#x52A0;&#x8F7D;&#x5230;&#x591A;&#x7EA7;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x4E0B;&#x6B21;&#x518D;&#x4F7F;&#x7528;&#x76F8;&#x5173;&#x7684;&#x6570;&#x636E;&#x76F4;&#x63A5;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x67E5;&#x627E;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x800C;&#x52A0;&#x8F7D;&#x5230;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x4E0D;&#x662F;&#x8BF4;&#x7528;&#x5230;&#x54EA;&#x4E2A;&#x5C31;&#x52A0;&#x8F7D;&#x54EA;&#x4E2A;&#xFF0C;&#x800C;&#x662F;&#x52A0;&#x8F7D;&#x5185;&#x5B58;&#x4E2D;&#x8FDE;&#x7EED;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x662F;&#x52A0;&#x8F7D;&#x8FDE;&#x7EED;&#x7684;64&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A; long &#x7C7B;&#x578B;&#x7684;&#x6570;&#x7EC4;&#x65F6;&#xFF0C;&#x5F53;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x503C;&#x88AB;&#x52A0;&#x8F7D;&#x5230;&#x7F13;&#x5B58;&#x4E2D;&#x65F6;&#xFF0C;&#x53E6;&#x5916; 7 &#x4E2A;&#x5143;&#x7D20;&#x4E5F;&#x4F1A;&#x88AB;&#x52A0;&#x8F7D;&#x5230;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x201C;&#x7F13;&#x5B58;&#x884C;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p><img src="media/15582712510625/JMM2.png" alt="JMM"></p>
<p>&#x7F13;&#x5B58;&#x884C;&#x867D;&#x7136;&#x80FD;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x5BF9;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x8FC7;&#x7A0B;&#x4E2D;&#x53C8;&#x5E26;&#x6765;&#x4E86;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x8457;&#x540D;&#x7684;&#x201C;&#x4F2A;&#x5171;&#x4EAB;&#x201D;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x4F2A;&#x5171;&#x4EAB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x5C55;&#x5F00;&#x8BB2;&#x4E86;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x53EF;&#x4EE5;&#x770B;&#x5F64;&#x54E5;&#x4E4B;&#x524D;&#x53D1;&#x5E03;&#x7684;&#x3010;<a href="https://link.juejin.im?target=https%3A%2F%2Fmp.weixin.qq.com%2Fs%2Frd13SOSxhLA6TT13N9ni8Q" target="_blank">&#x6742;&#x8C08; &#x4EC0;&#x4E48;&#x662F;&#x4F2A;&#x5171;&#x4EAB;&#xFF08;false sharing&#xFF09;&#xFF1F;</a>&#x3011;&#x7AE0;&#x8282;&#x7684;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;CPU&#x4E2D;&#x7684;&#x8FD0;&#x7B97;&#x5355;&#x5143;&#x80FD;&#x591F;&#x5145;&#x5206;&#x5730;&#x88AB;&#x5229;&#x7528;&#xFF0C;CPU&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x8F93;&#x5165;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8BA1;&#x7B97;&#x4E4B;&#x540E;&#x518D;&#x5C06;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x91CD;&#x7EC4;&#xFF0C;&#x4FDD;&#x8BC1;&#x8BE5;&#x7ED3;&#x679C;&#x4E0E;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x4E2D;&#x5404;&#x4E2A;&#x8BED;&#x53E5;&#x8BA1;&#x7B97;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x4E0E;&#x4EE3;&#x7801;&#x7684;&#x8F93;&#x5165;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#x4F9D;&#x8D56;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x987A;&#x5E8F;&#x6027;&#x5E76;&#x4E0D;&#x80FD;&#x9760;&#x4EE3;&#x7801;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x6765;&#x4FDD;&#x8BC1;&#x3002;</p>
<p>&#x4E0E;CPU&#x7684;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x4F18;&#x5316;&#x7C7B;&#x4F3C;&#xFF0C;java&#x865A;&#x62DF;&#x673A;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x591A;&#x4E2A;&#x7F13;&#x5B58;&#x8BFB;&#x5199;&#x4E00;&#x81F4;&#x6027;&#x4EE5;&#x53CA;&#x4E71;&#x5E8F;&#x6392;&#x5E8F;&#x4F18;&#x5316;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x5C31;&#x6709;&#x4E86;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x4E2D;&#x591A;&#x7EBF;&#x7A0B;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x884C;&#x4E3A;&#x7684;&#x89C4;&#x8303;&#x3002;</p>
<h2 id="java&#x5185;&#x5B58;&#x6A21;&#x578B;">Java&#x5185;&#x5B58;&#x6A21;&#x578B;</h2>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF08;Java Memory Model&#xFF0C;JMM&#xFF09;&#x662F;&#x5728;&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x57FA;&#x7840;&#x4E0A;&#x66F4;&#x9AD8;&#x5C42;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5B83;&#x5C4F;&#x853D;&#x4E86;&#x5404;&#x79CD;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BF9;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x8BA9;Java&#x7A0B;&#x5E8F;&#x5728;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x4E0B;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x5E76;&#x53D1;&#x6548;&#x679C;&#x3002;</p>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x5B9A;&#x4E49;&#x4E86;&#x7A0B;&#x5E8F;&#x4E2D;&#x5404;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x89C4;&#x5219;&#xFF0C;&#x5373;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x5C06;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x5230;&#x5185;&#x5B58;&#x548C;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x53D6;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#x3002;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x53D8;&#x91CF;&#x5305;&#x62EC;&#x5B9E;&#x4F8B;&#x5B57;&#x6BB5;&#x3001;&#x9759;&#x6001;&#x5B57;&#x6BB5;&#xFF0C;&#x4F46;&#x4E0D;&#x5305;&#x62EC;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x65B9;&#x6CD5;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x88AB;&#x5171;&#x4EAB;&#xFF0C;&#x81EA;&#x7136;&#x4E0D;&#x5B58;&#x5728;&#x7ADE;&#x4E89;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6267;&#x884C;&#x6548;&#x80FD;&#xFF0C;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x5E76;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x5904;&#x7406;&#x5668;&#x7684;&#x7279;&#x5B9A;&#x5BC4;&#x5B58;&#x5668;&#x6216;&#x7F13;&#x5B58;&#x6765;&#x548C;&#x4E3B;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x8C03;&#x6574;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x7B49;&#x8FD9;&#x7C7B;&#x6743;&#x5229;&#x3002;</p>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x89C4;&#x5B9A;&#x4E86;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x4E3B;&#x5185;&#x5B58;&#x8DDF;&#x4ECB;&#x7ECD;&#x786C;&#x4EF6;&#x65F6;&#x6240;&#x7528;&#x7684;&#x540D;&#x5B57;&#x4E00;&#x6837;&#xFF0C;&#x4E24;&#x8005;&#x53EF;&#x4EE5;&#x7C7B;&#x6BD4;&#xFF0C;&#x4F46;&#x6B64;&#x5904;&#x4EC5;&#x6307;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x5185;&#x5B58;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x8FD8;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x6B64;&#x5904;&#x53EF;&#x4E0E;CPU&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x8FDB;&#x884C;&#x7C7B;&#x6BD4;&#x3002;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x5B58;&#x7740;&#x8BE5;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x4E3B;&#x5185;&#x5B58;&#x526F;&#x672C;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x7EBF;&#x7A0B;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x5FC5;&#x987B;&#x5728;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#xFF0C;&#x5305;&#x62EC;&#x8BFB;&#x53D6;&#x548C;&#x8D4B;&#x503C;&#x7B49;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8BFB;&#x5199;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x4E5F;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5BF9;&#x65B9;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x7EBF;&#x7A0B;&#x95F4;&#x53D8;&#x91CF;&#x503C;&#x7684;&#x4F20;&#x9012;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x4E3B;&#x5185;&#x5B58;&#x6765;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x7EBF;&#x7A0B;&#x3001;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x3001;&#x4E3B;&#x5185;&#x5B58;&#x4E09;&#x8005;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="media/15582712510625/JMM3.png" alt="JMM"></p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x4E3B;&#x5185;&#x5B58;&#x3001;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x8DDF;Java&#x865A;&#x62DF;&#x673A;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x5212;&#x5206;&#x4E2D;&#x7684;&#x5806;&#x3001;&#x6808;&#x662F;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#x7684;&#x5185;&#x5B58;&#x5212;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x8005;&#x4E00;&#x5B9A;&#x8981;&#x52C9;&#x5F3A;&#x5BF9;&#x5E94;&#x8D77;&#x6765;&#xFF0C;&#x4E3B;&#x5185;&#x5B58;&#x4E3B;&#x8981;&#x5BF9;&#x5E94;&#x4E8E;&#x5806;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E3B;&#x8981;&#x5BF9;&#x5E94;&#x4E0E;&#x865A;&#x62DF;&#x673A;&#x6808;&#x4E2D;&#x7684;&#x90E8;&#x5206;&#x533A;&#x57DF;&#x3002;</p>
<p>&#x4ECE;&#x66F4;&#x4F4E;&#x5C42;&#x6B21;&#x6765;&#x8BF4;&#xFF0C;&#x4E3B;&#x5185;&#x5B58;&#x4E3B;&#x8981;&#x5BF9;&#x5E94;&#x4E8E;&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x90E8;&#x5206;&#xFF0C;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E3B;&#x8981;&#x5BF9;&#x5E94;&#x4E8E;CPU&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x548C;&#x5BC4;&#x5B58;&#x5668;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#xFF0C;&#x4E3B;&#x5185;&#x5B58;&#x4E5F;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E8E;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x548C;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E5F;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E8E;&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p><img src="media/15582712510625/JMM4.png" alt="JMM"></p>
<h2 id="&#x5185;&#x5B58;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x64CD;&#x4F5C;">&#x5185;&#x5B58;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x64CD;&#x4F5C;</h2>
<p>&#x5173;&#x4E8E;&#x4E3B;&#x5185;&#x5B58;&#x4E0E;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E4B;&#x95F4;&#x5177;&#x4F53;&#x7684;&#x4EA4;&#x4E92;&#x534F;&#x8BAE;&#xFF0C;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x5B9A;&#x4E49;&#x4E86;&#x4EE5;&#x4E0B;8&#x79CD;&#x5177;&#x4F53;&#x7684;&#x64CD;&#x4F5C;&#x6765;&#x5B8C;&#x6210;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;lock&#xFF0C;&#x9501;&#x5B9A;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x4E3B;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x6807;&#x8BC6;&#x4E3A;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x72EC;&#x5360;&#x72B6;&#x6001;&#xFF1B;</p>
<p>&#xFF08;2&#xFF09;unlock&#xFF0C;&#x89E3;&#x9501;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x4E3B;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;&#x9501;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#x91CA;&#x653E;&#x51FA;&#x6765;&#xFF0C;&#x91CA;&#x653E;&#x51FA;&#x6765;&#x7684;&#x53D8;&#x91CF;&#x624D;&#x53EF;&#x4EE5;&#x88AB;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x9501;&#x5B9A;&#xFF1B;</p>
<p>&#xFF08;3&#xFF09;read&#xFF0C;&#x8BFB;&#x53D6;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x4E3B;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x4F20;&#x8F93;&#x5230;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4EE5;&#x4FBF;&#x540E;&#x7EED;&#x7684;load&#x64CD;&#x4F5C;&#x4F7F;&#x7528;&#xFF1B;</p>
<p>&#xFF08;4&#xFF09;load&#xFF0C;&#x8F7D;&#x5165;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;read&#x64CD;&#x4F5C;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x5F97;&#x5230;&#x7684;&#x53D8;&#x91CF;&#x653E;&#x5165;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#x526F;&#x672C;&#x4E2D;&#xFF1B;</p>
<p>&#xFF08;5&#xFF09;use&#xFF0C;&#x4F7F;&#x7528;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4F20;&#x9012;&#x7ED9;&#x6267;&#x884C;&#x5F15;&#x64CE;&#xFF0C;&#x6BCF;&#x5F53;&#x865A;&#x62DF;&#x673A;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5230;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x65F6;&#x5C06;&#x4F1A;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#xFF1B;</p>
<p>&#xFF08;6&#xFF09;assign&#xFF0C;&#x8D4B;&#x503C;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;&#x4E00;&#x4E2A;&#x4ECE;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x63A5;&#x6536;&#x5230;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x7ED9;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6BCF;&#x5F53;&#x865A;&#x62DF;&#x673A;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x7ED9;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x65F6;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#xFF1B;</p>
<p>&#xFF08;7&#xFF09;store&#xFF0C;&#x5B58;&#x50A8;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x4F20;&#x9012;&#x5230;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4EE5;&#x4FBF;&#x540E;&#x7EED;&#x7684;write&#x64CD;&#x4F5C;&#x4F7F;&#x7528;&#xFF1B;</p>
<p>&#xFF08;8&#xFF09;write&#xFF0C;&#x5199;&#x5165;&#xFF0C;&#x4F5C;&#x7528;&#x4E8E;&#x4E3B;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x628A;store&#x64CD;&#x4F5C;&#x4ECE;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x5F97;&#x5230;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x653E;&#x5165;&#x5230;&#x4E3B;&#x5185;&#x5B58;&#x7684;&#x53D8;&#x91CF;&#x4E2D;&#xFF1B;</p>
<p>&#x5982;&#x679C;&#x8981;&#x628A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x590D;&#x5236;&#x5230;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x6309;&#x987A;&#x5E8F;&#x5730;&#x6267;&#x884C;read&#x548C;load&#x64CD;&#x4F5C;&#xFF0C;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x628A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4ECE;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;&#x5C31;&#x8981;&#x6309;&#x987A;&#x5E8F;&#x5730;&#x6267;&#x884C;store&#x548C;write&#x64CD;&#x4F5C;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x8BF4;&#x660E;&#x4E86;&#x8981;&#x6309;&#x987A;&#x5E8F;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x8BF4;&#x4E00;&#x5B9A;&#x8981;&#x8FDE;&#x7EED;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53EF;&#x4EE5;&#x5728;read&#x4E0E;load&#x4E4B;&#x95F4;&#x3001;store&#x4E0E;write&#x4E4B;&#x95F4;&#x63D2;&#x5165;&#x5176;&#x5B83;&#x64CD;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5BF9;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x53D8;&#x91CF;a&#x548C;b&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x4EE5;&#x4E0B;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF1A;</p>
<p>read a -&gt; read b -&gt; load b -&gt; load a&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x8FD8;&#x5B9A;&#x4E49;&#x4E86;&#x6267;&#x884C;&#x4E0A;&#x8FF0;8&#x79CD;&#x64CD;&#x4F5C;&#x7684;&#x57FA;&#x672C;&#x89C4;&#x5219;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x4E0D;&#x5141;&#x8BB8;read&#x548C;load&#x3001;store&#x548C;write&#x64CD;&#x4F5C;&#x4E4B;&#x4E00;&#x5355;&#x72EC;&#x51FA;&#x73B0;&#xFF0C;&#x5373;&#x4E0D;&#x5141;&#x8BB8;&#x51FA;&#x73B0;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x8BFB;&#x53D6;&#x4E86;&#x800C;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E0D;&#x63A5;&#x53D7;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x56DE;&#x5199;&#x4E86;&#x4F46;&#x4E3B;&#x5185;&#x5B58;&#x4E0D;&#x63A5;&#x53D7;&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#xFF1B;</p>
<p>&#xFF08;2&#xFF09;&#x4E0D;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E22;&#x5F03;&#x5B83;&#x6700;&#x8FD1;&#x7684;assign&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x53D8;&#x91CF;&#x5728;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x53D8;&#x5316;&#x4E86;&#x5FC5;&#x987B;&#x628A;&#x8BE5;&#x53D8;&#x5316;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF1B;</p>
<p>&#xFF08;3&#xFF09;&#x4E0D;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x65E0;&#x539F;&#x56E0;&#x5730;&#xFF08;&#x5373;&#x672A;&#x53D1;&#x751F;&#x8FC7;assign&#x64CD;&#x4F5C;&#xFF09;&#x628A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4ECE;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF1B;</p>
<p>&#xFF08;4&#xFF09;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#x5FC5;&#x987B;&#x5728;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x8BDE;&#x751F;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x672A;&#x88AB;&#x521D;&#x59CB;&#x5316;&#xFF08;load&#x6216;assign&#xFF09;&#x8FC7;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;use&#x548C;store&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x8FC7;load&#x548C;assign&#x64CD;&#x4F5C;&#xFF1B;</p>
<p>&#xFF08;5&#xFF09;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;lock&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;lock&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x88AB;&#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x591A;&#x6B21;&#xFF0C;&#x591A;&#x6B21;&#x6267;&#x884C;lock&#x540E;&#xFF0C;&#x53EA;&#x6709;&#x6267;&#x884C;&#x76F8;&#x540C;&#x6B21;&#x6570;&#x7684;unlock&#x64CD;&#x4F5C;&#xFF0C;&#x53D8;&#x91CF;&#x624D;&#x80FD;&#x88AB;&#x89E3;&#x9501;&#x3002;</p>
<p>&#xFF08;6&#xFF09;&#x5982;&#x679C;&#x5BF9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6267;&#x884C;lock&#x64CD;&#x4F5C;&#xFF0C;&#x5C06;&#x4F1A;&#x6E05;&#x7A7A;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x6B64;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x6267;&#x884C;load&#x6216;assign&#x64CD;&#x4F5C;&#x521D;&#x59CB;&#x5316;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF1B;</p>
<p>&#xFF08;7&#xFF09;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6CA1;&#x6709;&#x88AB;lock&#x64CD;&#x4F5C;&#x9501;&#x5B9A;&#xFF0C;&#x5219;&#x4E0D;&#x5141;&#x8BB8;&#x5BF9;&#x5176;&#x6267;&#x884C;unlock&#x64CD;&#x4F5C;&#xFF0C;&#x4E5F;&#x4E0D;&#x5141;&#x8BB8;unlock&#x4E00;&#x4E2A;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x9501;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#xFF1B;</p>
<p>&#xFF08;8&#xFF09;&#x5BF9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6267;&#x884C;unlock&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x628A;&#x6B64;&#x53D8;&#x91CF;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5373;&#x6267;&#x884C;store&#x548C;write&#x64CD;&#x4F5C;&#xFF1B;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;lock&#x548C;unlock&#x662F;&#x5B9E;&#x73B0;synchronized&#x7684;&#x57FA;&#x7840;&#xFF0C;Java&#x5E76;&#x6CA1;&#x6709;&#x628A;lock&#x548C;unlock&#x64CD;&#x4F5C;&#x76F4;&#x63A5;&#x5F00;&#x653E;&#x7ED9;&#x7528;&#x6237;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x4E2A;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x6307;&#x4EE4;&#x6765;&#x9690;&#x5F0F;&#x5730;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;moniterenter&#x548C;moniterexit&#x3002;</p>
<h2 id="&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x6709;&#x5E8F;&#x6027;">&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x6709;&#x5E8F;&#x6027;</h2>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x81F4;&#x6027;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x5185;&#x5BB9;&#x5462;&#xFF1F;</p>
<p>&#x4E00;&#x81F4;&#x6027;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4E09;&#x5927;&#x7279;&#x6027;&#xFF1A;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x6709;&#x5E8F;&#x6027;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x770B;&#x770B;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x662F;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x8FD9;&#x4E09;&#x5927;&#x7279;&#x6027;&#x7684;&#x3002;</p>
<p>&#xFF08;1&#xFF09;&#x539F;&#x5B50;&#x6027;</p>
<p>&#x539F;&#x5B50;&#x6027;&#x662F;&#x6307;&#x4E00;&#x6BB5;&#x64CD;&#x4F5C;&#x4E00;&#x65E6;&#x5F00;&#x59CB;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x5230;&#x5E95;&#xFF0C;&#x4E2D;&#x95F4;&#x4E0D;&#x4F1A;&#x88AB;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x6253;&#x65AD;&#xFF0C;&#x8FD9;&#x6BB5;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x591A;&#x4E2A;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x7531;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x6765;&#x76F4;&#x63A5;&#x4FDD;&#x8BC1;&#x7684;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#x5305;&#x62EC;read&#x3001;load&#x3001;user&#x3001;assign&#x3001;store&#x3001;write&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x8BA4;&#x4E3A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x5199;&#x662F;&#x5177;&#x5907;&#x539F;&#x5B50;&#x6027;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x7684;&#x539F;&#x5B50;&#x6027;&#xFF0C;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;lock&#x548C;unlock&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x6765;&#x6EE1;&#x8DB3;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;synchronized&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;synchronized&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x662F;&#x539F;&#x5B50;&#x6027;&#x7684;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x53EF;&#x89C1;&#x6027;</p>
<p>&#x53EF;&#x89C1;&#x6027;&#x662F;&#x6307;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;&#x4E86;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x80FD;&#x7ACB;&#x5373;&#x611F;&#x77E5;&#x5230;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x3002;</p>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x53D8;&#x66F4;&#x4FEE;&#x6539;&#x540E;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;&#x5728;&#x53D8;&#x91CF;&#x8BFB;&#x53D6;&#x524D;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x5237;&#x65B0;&#x53D8;&#x91CF;&#x503C;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x4F9D;&#x8D56;&#x4E3B;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x8FD8;&#x662F;volatile&#x53D8;&#x91CF;&#x90FD;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x666E;&#x901A;&#x53D8;&#x91CF;&#x4E0E;volatile&#x53D8;&#x91CF;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x662F;&#x662F;&#x5426;&#x4F1A;&#x5728;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#x7ACB;&#x5373;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x5728;&#x6BCF;&#x6B21;&#x8BFB;&#x53D6;&#x524D;&#x7ACB;&#x5373;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x5237;&#x65B0;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;volatile&#x53D8;&#x91CF;&#x4FDD;&#x8BC1;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;&#x53D8;&#x91CF;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x4F46;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x9664;&#x4E86;volatile&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x4E5F;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;synchronized&#x548C;final&#x3002;</p>
<p>synchronized&#x7684;&#x53EF;&#x89C1;&#x6027;&#x662F;&#x7531;&#x201C;&#x5BF9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6267;&#x884C;unlock&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x628A;&#x6B64;&#x53D8;&#x91CF;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5373;&#x6267;&#x884C;store&#x548C;write&#x64CD;&#x4F5C;&#x201D;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x83B7;&#x53D6;&#x7684;&#x3002;</p>
<p>final&#x7684;&#x53EF;&#x89C1;&#x6027;&#x662F;&#x6307;&#x88AB;final&#x4FEE;&#x9970;&#x7684;&#x5B57;&#x6BB5;&#x5728;&#x6784;&#x9020;&#x5668;&#x4E2D;&#x4E00;&#x65E6;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x4E2D;&#x5C31;&#x80FD;&#x770B;&#x89C1;&#x8FD9;&#x4E2A;final&#x5B57;&#x6BB5;&#x4E86;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x6709;&#x5E8F;&#x6027;</p>
<p>Java&#x7A0B;&#x5E8F;&#x4E2D;&#x5929;&#x7136;&#x7684;&#x6709;&#x5E8F;&#x6027;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x4E3A;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x5982;&#x679C;&#x5728;&#x672C;&#x7EBF;&#x7A0B;&#x4E2D;&#x89C2;&#x5BDF;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x89C2;&#x5BDF;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x65E0;&#x5E8F;&#x7684;&#x3002;</p>
<p>&#x524D;&#x534A;&#x53E5;&#x662F;&#x6307;&#x7EBF;&#x7A0B;&#x5185;&#x8868;&#x73B0;&#x4E3A;&#x4E32;&#x884C;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x540E;&#x534A;&#x53E5;&#x662F;&#x6307;&#x201C;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x201D;&#x73B0;&#x8C61;&#x548C;&#x201C;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x548C;&#x4E3B;&#x5185;&#x5B58;&#x540C;&#x6B65;&#x5EF6;&#x8FDF;&#x201D;&#x73B0;&#x8C61;&#x3002;</p>
<p>Java&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;volatile&#x548C;synchronized&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x6765;&#x4FDD;&#x8BC1;&#x6709;&#x5E8F;&#x6027;&#x3002;</p>
<p>volatile&#x5929;&#x7136;&#x5C31;&#x5177;&#x6709;&#x6709;&#x5E8F;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x7981;&#x6B62;&#x91CD;&#x6392;&#x5E8F;&#x3002;</p>
<p>synchronized&#x7684;&#x6709;&#x5E8F;&#x6027;&#x662F;&#x7531;&#x201C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;lock&#x64CD;&#x4F5C;&#x201D;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x83B7;&#x53D6;&#x7684;&#x3002;</p>
<h2 id="&#x5148;&#x884C;&#x53D1;&#x751F;&#x539F;&#x5219;&#xFF08;happens-before&#xFF09;">&#x5148;&#x884C;&#x53D1;&#x751F;&#x539F;&#x5219;&#xFF08;Happens-Before&#xFF09;</h2>
<p>&#x5982;&#x679C;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x7684;&#x6709;&#x5E8F;&#x6027;&#x90FD;&#x53EA;&#x4F9D;&#x9760;volatile&#x548C;synchronized&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48;&#x6709;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5570;&#x55E6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x7F16;&#x5199;Java&#x5E76;&#x53D1;&#x4EE3;&#x7801;&#x65F6;&#x5E76;&#x6CA1;&#x6709;&#x611F;&#x53D7;&#x5230;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;Java&#x8BED;&#x8A00;&#x5929;&#x7136;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x201D;&#x539F;&#x5219;&#xFF0C;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x4F9D;&#x9760;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5224;&#x65AD;&#x5728;&#x5E76;&#x53D1;&#x73AF;&#x5883;&#x4E0B;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7ADE;&#x4E89;&#x51B2;&#x7A81;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5148;&#x884C;&#x53D1;&#x751F;&#xFF0C;&#x662F;&#x6307;&#x64CD;&#x4F5C;A&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C;B&#xFF0C;&#x90A3;&#x4E48;&#x64CD;&#x4F5C;A&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x80FD;&#x591F;&#x88AB;&#x64CD;&#x4F5C;B&#x611F;&#x77E5;&#x5230;&#xFF0C;&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x5305;&#x62EC;&#x4FEE;&#x6539;&#x4E86;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x4E2D;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x3001;&#x53D1;&#x9001;&#x4E86;&#x6D88;&#x606F;&#x3001;&#x8C03;&#x7528;&#x4E86;&#x65B9;&#x6CD5;&#x7B49;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x770B;&#x770B;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x5B9A;&#x4E49;&#x7684;&#x5148;&#x884C;&#x53D1;&#x751F;&#x539F;&#x5219;&#x6709;&#x54EA;&#x4E9B;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x7A0B;&#x5E8F;&#x6B21;&#x5E8F;&#x539F;&#x5219;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5185;&#xFF0C;&#x6309;&#x7167;&#x7A0B;&#x5E8F;&#x4E66;&#x5199;&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x4E66;&#x5199;&#x5728;&#x524D;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x4E66;&#x5199;&#x5728;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x51C6;&#x786E;&#x5730;&#x8BB2;&#x662F;&#x63A7;&#x5236;&#x6D41;&#x987A;&#x5E8F;&#x800C;&#x4E0D;&#x662F;&#x4EE3;&#x7801;&#x987A;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x8003;&#x8651;&#x5206;&#x652F;&#x3001;&#x5FAA;&#x73AF;&#x7B49;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x76D1;&#x89C6;&#x5668;&#x9501;&#x5B9A;&#x539F;&#x5219;</p>
<p>&#x4E00;&#x4E2A;unlock&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x540E;&#x9762;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x7684;lock&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#xFF08;3&#xFF09;volatile&#x539F;&#x5219;</p>
<p>&#x5BF9;&#x4E00;&#x4E2A;volatile&#x53D8;&#x91CF;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x540E;&#x9762;&#x5BF9;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x7EBF;&#x7A0B;&#x542F;&#x52A8;&#x539F;&#x5219;</p>
<p>&#x5BF9;&#x7EBF;&#x7A0B;&#x7684;start()&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x7EBF;&#x7A0B;&#x5185;&#x7684;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#xFF08;5&#xFF09;&#x7EBF;&#x7A0B;&#x7EC8;&#x6B62;&#x539F;&#x5219;</p>
<p>&#x7EBF;&#x7A0B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x68C0;&#x6D4B;&#x5230;&#x7EBF;&#x7A0B;&#x7EC8;&#x6B62;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Thread.join()&#x3001;Thread.isAlive()&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x68C0;&#x6D4B;&#x7EBF;&#x7A0B;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x7EC8;&#x6B62;&#x3002;</p>
<p>&#xFF08;6&#xFF09;&#x7EBF;&#x7A0B;&#x4E2D;&#x65AD;&#x539F;&#x5219;</p>
<p>&#x5BF9;&#x7EBF;&#x7A0B;&#x7684;interrupt()&#x7684;&#x8C03;&#x7528;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x7EBF;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x68C0;&#x6D4B;&#x5230;&#x4E2D;&#x65AD;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Thread.interrupted()&#x65B9;&#x6CD5;&#x68C0;&#x6D4B;&#x662F;&#x5426;&#x53D1;&#x751F;&#x4E2D;&#x65AD;&#x3002;</p>
<p>&#xFF08;7&#xFF09;&#x5BF9;&#x8C61;&#x7EC8;&#x7ED3;&#x539F;&#x5219;</p>
<p>&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6210;&#xFF08;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF09;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x5B83;&#x7684;finalize()&#x65B9;&#x6CD5;&#x7684;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#xFF08;8&#xFF09;&#x4F20;&#x9012;&#x6027;&#x539F;&#x5219;</p>
<p>&#x5982;&#x679C;&#x64CD;&#x4F5C;A&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C;B&#xFF0C;&#x64CD;&#x4F5C;B&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C;C&#xFF0C;&#x90A3;&#x4E48;&#x64CD;&#x4F5C;A&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C;C&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x201C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x201D;&#x4E0E;&#x201C;&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x5148;&#x53D1;&#x751F;&#x201D;&#x6CA1;&#x6709;&#x5FC5;&#x7136;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>int a = 0;

// &#x64CD;&#x4F5C;A&#xFF1A;&#x7EBF;&#x7A0B;1&#x5BF9;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;
a = 1;

// &#x64CD;&#x4F5C;B&#xFF1A;&#x7EBF;&#x7A0B;2&#x83B7;&#x53D6;a&#x7684;&#x503C;

int b = a;
&#x590D;&#x5236;&#x4EE3;&#x7801;
</code></pre><p>&#x5982;&#x679C;&#x7EBF;&#x7A0B;1&#x5728;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x4E0A;&#x5148;&#x5BF9;a&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x7EBF;&#x7A0B;2&#x518D;&#x83B7;&#x53D6;a&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x80FD;&#x8BF4;&#x660E;&#x64CD;&#x4F5C;A&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C;B&#x5417;&#xFF1F;</p>
<p>&#x663E;&#x7136;&#x4E0D;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x7EBF;&#x7A0B;2&#x53EF;&#x80FD;&#x8BFB;&#x53D6;&#x7684;&#x8FD8;&#x662F;&#x5176;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x7EBF;&#x7A0B;1&#x5E76;&#x6CA1;&#x6709;&#x628A;a&#x7684;&#x503C;&#x5237;&#x65B0;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#x5462;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x7EBF;&#x7A0B;2&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x503C;&#x53EF;&#x80FD;&#x8FD8;&#x662F;0&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x201C;&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x5148;&#x53D1;&#x751F;&#x201D;&#x4E0D;&#x4E00;&#x5B9A;&#x201C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x201D;&#x3002;</p>
<p>&#x518D;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>// &#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;
int i = 1;

int j = 2;
&#x590D;&#x5236;&#x4EE3;&#x7801;
</code></pre><p>&#x6839;&#x636E;&#x7B2C;&#x4E00;&#x6761;&#x7A0B;&#x5E8F;&#x6B21;&#x5E8F;&#x539F;&#x5219;&#xFF0C;<code>int i = 1;</code>&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;<code>int j = 2;</code>&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x4F18;&#x5316;&#xFF0C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;<code>int j = 2;</code>&#x5148;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x5F71;&#x54CD;&#x5148;&#x884C;&#x53D1;&#x751F;&#x539F;&#x5219;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5E76;&#x4E0D;&#x4F1A;&#x611F;&#x77E5;&#x5230;&#x8FD9;&#x70B9;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x201C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x201D;&#x4E0D;&#x4E00;&#x5B9A;&#x201C;&#x65F6;&#x95F4;&#x4E0A;&#x5148;&#x53D1;&#x751F;&#x201D;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#xFF08;1&#xFF09;&#x786C;&#x4EF6;&#x5185;&#x5B58;&#x67B6;&#x6784;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5EFA;&#x7ACB;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x6765;&#x4FDD;&#x8BC1;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;&#x5BF9;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF1B;</p>
<p>&#xFF08;2&#xFF09;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x5B9A;&#x4E49;&#x4E86;&#x4FDD;&#x8BC1;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x89C4;&#x5219;&#xFF1B;</p>
<p>&#xFF08;3&#xFF09;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E0E;&#x4E3B;&#x5185;&#x5B58;&#x4EA4;&#x4E92;&#x7684;8&#x5927;&#x64CD;&#x4F5C;&#xFF1A;lock&#x3001;unlock&#x3001;read&#x3001;load&#x3001;use&#x3001;assign&#x3001;store&#x3001;write&#xFF1B;</p>
<p>&#xFF08;4&#xFF09;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x5BF9;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x6709;&#x5E8F;&#x6027;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x5B9E;&#x73B0;&#xFF1B;</p>
<p>&#xFF08;5&#xFF09;&#x5148;&#x884C;&#x53D1;&#x751F;&#x7684;8&#x5927;&#x539F;&#x5219;&#xFF1A;&#x7A0B;&#x5E8F;&#x6B21;&#x5E8F;&#x539F;&#x5219;&#x3001;&#x76D1;&#x89C6;&#x5668;&#x9501;&#x5B9A;&#x539F;&#x5219;&#x3001;volatile&#x539F;&#x5219;&#x3001;&#x7EBF;&#x7A0B;&#x542F;&#x52A8;&#x539F;&#x5219;&#x3001;&#x7EBF;&#x7A0B;&#x7EC8;&#x6B62;&#x539F;&#x5219;&#x3001;&#x7EBF;&#x7A0B;&#x4E2D;&#x65AD;&#x539F;&#x5219;&#x3001;&#x5BF9;&#x8C61;&#x7EC8;&#x7ED3;&#x539F;&#x5219;&#x3001;&#x4F20;&#x9012;&#x6027;&#x539F;&#x5219;&#xFF1B;</p>
<p>&#xFF08;6&#xFF09;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E0D;&#x7B49;&#x4E8E;&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x5148;&#x53D1;&#x751F;&#xFF1B; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; books.sangkf.cn 2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2019-05-19 21:09:34
</span></footer>
						
					</section>
					
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

				</div>
			</div>
			
		</div>

		
		
		<a href="java1.html" class="navigation navigation-prev " aria-label="Previous page: JVM原理讲解">
			<i class="fa fa-angle-left"></i>
		</a>
		
		
		<a href="../codePart/part1.html" class="navigation navigation-next " aria-label="Next page: 反射工具类">
			<i class="fa fa-angle-right"></i>
		</a>
		
		
		
	</div>
	<script>
		var gitbook = gitbook || [];
		gitbook.push(function() {
			gitbook.page.hasChanged({"page":{"title":"java同步系列之JMM","level":"2.2","depth":1,"next":{"title":"反射工具类","level":"3.1","depth":1,"path":"content/codePart/part1.md","ref":"content/codePart/part1.md","articles":[]},"previous":{"title":"JVM原理讲解","level":"2.1","depth":1,"path":"content/java/java1.md","ref":"content/java/java1.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-highlight","-sharing","-fontsettings","sitemap","tbfed-pagefooter","-lunr","-search","search-plus","theme-fexa","back-to-top-button","copy-code-button","cuav-chapters","heading-anchors"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy books.sangkf.cn 2019","modify_label":"该文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"styles":{"website":"styles/website.css"},"cuav-chapters":{"summaryMaxSize":20,"useLimitExpanded":false},"theme-fexa":{"search-placeholder":"输入关键字搜索"},"heading-anchors":{},"sitemap":{"hostname":"http://books.sangkf.cn/"},"back-to-top-button":{},"copy-code-button":{},"sharing":{"weibo":false,"facebook":false,"twitter":false,"google":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"search-plus":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"themeFexa":{"nav":[{"url":"http://books.sangkf.cn","target":"_blank","name":"作者博客"},{"url":"https://github.com/sangskf/it-s-stupid","target":"_blank","name":"GitHub"}]}},"title":"蠢萌小呆瓜的工作日志","language":"zh-hans","gitbook":"*","description":"蠢萌小呆瓜的工作日志"},"file":{"path":"content/java/java2.md","mtime":"2019-05-19T13:09:34.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-19T13:10:19.659Z"},"basePath":"../..","book":{"language":""}});
		});
	</script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-cuav-chapters/cuav-chapters.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/anchor-js/1.2.1/anchor.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-heading-anchors/anchor-style.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-theme-fexa/fexa.js"></script>
        
    

    </body>
</html>

